{
  "Programming": [
    {
      "id": "u13hVoYVZa8C",
      "volumeInfo": {
        "title": "Planning Extreme Programming",
        "authors": ["Kent Beck", "Martin Fowler"],
        "publisher": "Addison-Wesley Professional",
        "publishedDate": "2001",
        "description": "Without careful ongoing planning, the software development process can fall apart. Extreme Programming (XP) is a new programming discipline, or methodology, that is geared toward the way that the vast majority of software development projects are handled -- in small teams. In this new book, noted software engineers Kent Beck and Martin Fowler show the reader how to properly plan a software development project with XP in mind. The authors lay out a proven strategy that forces the reader to plan as their software project unfolds, and therefore avoid many of the nasty problems that can potentially spring up along the way.",
        "categories": "Computers",
        "averageRating": 4,
        "contentVersion": "0.2.4.0.preview.1",
        "imageLinks": {
          "smallThumbnail": "http://books.google.com/books/content?id=u13hVoYVZa8C&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
          "thumbnail": "http://books.google.com/books/content?id=u13hVoYVZa8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
        },
        "language": "en"
      },
      "saleInfo": {
        "country": "EG",
        "price": "12"
      }
    },
    {
      "id": "b-2oDwAAQBAJ",
      "volumeInfo": {
        "title": "Python Programming in Context",
        "authors": ["Bradley N. Miller", "David L. Ranum", "Julie Anderson"],
        "publisher": "Jones & Bartlett Learning",
        "publishedDate": "2019-10-01",
        "description": "Python Programming in Context, Third Edition provides a comprehensive and accessible introduction to Python fundamentals. Updated with the latest version of Python, the new Third Edition offers a thorough overview of multiple applied areas, including image processing, cryptography, astronomy, the Internet, and bioinformatics. Taking an active learning approach, each chapter starts with a comprehensive real-world project that teaches core design techniques and Python programming while engaging students. An ideal first language for learners entering the rapidly expanding field of computer science, Python gives students a solid platform of key problem-solving skills that translate easily across programming languages.",
        "categories": "Computers",
        "averageRating": 4,
        "contentVersion": "0.1.1.0.preview.1",
        "imageLinks": {
          "smallThumbnail": "http://books.google.com/books/content?id=b-2oDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
          "thumbnail": "http://books.google.com/books/content?id=b-2oDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
        },
        "language": "en"
      },
      "saleInfo": {
        "country": "EG",
        "price": "10"
      }
    },
    {
      "id": "mh0bU6NXrBgC",
      "volumeInfo": {
        "title": "Core Python Programming",
        "authors": ["Wesley Chun"],
        "publisher": "Prentice Hall Professional",
        "publishedDate": "2001",
        "description": "Experts and novices alike will be able to find information about every command they'll need to use Linux. This complete, practical desk reference is organized by function, with a road map-style alphabetical reference for quick access of information about all aspects of running and administering the program. The CD-ROM contains Windows and Linux Python distributions plus extensive cross-platform source code from the book.",
        "categories": "Electronic books",
        "averageRating": 3.5,
        "contentVersion": "0.2.1.0.preview.1",
        "imageLinks": {
          "smallThumbnail": "http://books.google.com/books/content?id=mh0bU6NXrBgC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
          "thumbnail": "http://books.google.com/books/content?id=mh0bU6NXrBgC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
        },
        "language": "en"
      },
      "saleInfo": {
        "country": "EG",
        "price": "15"
      }
    },
    {
      "id": "2tAwEAAAQBAJ",
      "volumeInfo": {
        "title": "Expert Python Programming",
        "subtitle": "Master Python by learning the best coding practices and advanced programming concepts, 4th Edition",
        "authors": ["Michał Jaworski", "Tarek Ziadé"],
        "publisher": "Packt Publishing Ltd",
        "publishedDate": "2021-05-28",
        "description": "Gain a deep understanding of building, maintaining, packaging, and shipping robust Python applications Key FeaturesDiscover the new features of Python, such as dictionary merge, the zoneinfo module, and structural pattern matchingCreate manageable code to run in various environments with different sets of dependenciesImplement effective Python data structures and algorithms to write, test, and optimize codeBook Description This new edition of Expert Python Programming provides you with a thorough understanding of the process of building and maintaining Python apps. Complete with best practices, useful tools, and standards implemented by professional Python developers, this fourth edition has been extensively updated. Throughout this book, you’ll get acquainted with the latest Python improvements, syntax elements, and interesting tools to boost your development efficiency. The initial few chapters will allow experienced programmers coming from different languages to transition to the Python ecosystem. You will explore common software design patterns and various programming methodologies, such as event-driven programming, concurrency, and metaprogramming. You will also go through complex code examples and try to solve meaningful problems by bridging Python with C and C++, writing extensions that benefit from the strengths of multiple languages. Finally, you will understand the complete lifetime of any application after it goes live, including packaging and testing automation. By the end of this book, you will have gained actionable Python programming insights that will help you effectively solve challenging problems. What you will learnExplore modern ways of setting up repeatable and consistent Python development environmentsEffectively package Python code for community and production useLearn modern syntax elements of Python programming, such as f-strings, enums, and lambda functionsDemystify metaprogramming in Python with metaclassesWrite concurrent code in PythonExtend and integrate Python with code written in C and C++Who this book is for The Python programming book is intended for expert programmers who want to learn Python’s advanced-level concepts and latest features. Anyone who has basic Python skills should be able to follow the content of the book, although it might require some additional effort from less experienced programmers. It should also be a good introduction to Python 3.9 for those who are still a bit behind and continue to use other older versions.",
        "categories": "Computers",
        "averageRating": 4.5,
        "contentVersion": "2.4.4.0.preview.3",
        "imageLinks": {
          "smallThumbnail": "http://books.google.com/books/content?id=2tAwEAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
          "thumbnail": "http://books.google.com/books/content?id=2tAwEAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
        },
        "language": "en"
      },
      "saleInfo": {
        "country": "EG",
        "price": "20"
      }
    },
    {
      "id": "NXoOrjq9XawC",
      "volumeInfo": {
        "title": "Beginning Object-Oriented Programming with C#",
        "authors": ["Jack Purdum"],
        "publisher": "John Wiley & Sons",
        "publishedDate": "2012-11-05",
        "description": "The ideal beginner's guide to C# and object-oriented programming Wrox beginners' guides have the perfect formula for getting programming newcomers up and running. This one introduces beginners to object-oriented programming using C# to demonstrate all of the core constructs of this programming framework. Using real-world situations, you'll discover how to create, test, and deliver your programs and how to work with classes, arrays, collections, and all the elements of object-oriented programming. Covers exactly what beginners, even those with no prior programming experience, need to know to understand object-oriented programming and start writing programs in C# Explains the advantages and disadvantages of C#, and tips for understanding C# syntax Explores properties, encapsulation, and classes; value data types; operands and operators; errors and debugging; variables; and reference types Shows how to use statement repetition and program loops, understand arrays and collections, and write your own classes Also covers inheritance and polymorphism Beginning Object-Oriented Programming with C# uses the tried-and-true Wrox formula for making this popular programming method easy to learn.",
        "categories": "Computers",
        "averageRating": 2.5,
        "contentVersion": "1.2.3.0.preview.3",
        "imageLinks": {
          "smallThumbnail": "http://books.google.com/books/content?id=NXoOrjq9XawC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
          "thumbnail": "http://books.google.com/books/content?id=NXoOrjq9XawC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
        },
        "language": "en"
      },
      "saleInfo": {
        "country": "EG",
        "price": "20"
      }
    },
    {
      "id": "Zu-HAwAAQBAJ",
      "volumeInfo": {
        "title": "The Art of Computer Programming",
        "subtitle": "Seminumerical Algorithms, Volume 2",
        "authors": ["Donald E. Knuth"],
        "publisher": "Addison-Wesley Professional",
        "publishedDate": "2014-05-06",
        "description": "The bible of all fundamental algorithms and the work that taught many of today's software developers most of what they know about computer programming. –Byte, September 1995 I can't begin to tell you how many pleasurable hours of study and recreation they have afforded me! I have pored over them in cars, restaurants, at work, at home... and even at a Little League game when my son wasn't in the line-up. –Charles Long If you think you're a really good programmer... read [Knuth's] Art of Computer Programming... You should definitely send me a resume if you can read the whole thing. –Bill Gates It's always a pleasure when a problem is hard enough that you have to get the Knuths off the shelf. I find that merely opening one has a very useful terrorizing effect on computers. –Jonathan Laventhol The second volume offers a complete introduction to the field of seminumerical algorithms, with separate chapters on random numbers and arithmetic. The book summarizes the major paradigms and basic theory of such algorithms, thereby providing a comprehensive interface between computer programming and numerical analysis. Particularly noteworthy in this third edition is Knuth's new treatment of random number generators, and his discussion of calculations with formal power series. Ebook (PDF version) produced by Mathematical Sciences Publishers (MSP),http://msp.org",
        "categories": "Computers",
        "averageRating": 4.5,
        "contentVersion": "0.6.6.0.preview.3",
        "imageLinks": {
          "smallThumbnail": "http://books.google.com/books/content?id=Zu-HAwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
          "thumbnail": "http://books.google.com/books/content?id=Zu-HAwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
        },
        "language": "en"
      },
      "saleInfo": {
        "country": "EG",
        "price": "30"
      }
    }
  ],
  "Story": [
    {
      "id": "D3E_DwAAQBAJ",
      "volumeInfo": {
        "title": "The Giant Turnip Story",
        "authors": ["Dino Lingo"],
        "publisher": "Dino Lingo",
        "publishedDate": "2016-09-20",
        "description": "The Giant Turnip Story",
        "averageRating": 4,
        "contentVersion": "1.1.1.0.preview.3",
        "imageLinks": {
          "smallThumbnail": "http://books.google.com/books/content?id=D3E_DwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
          "thumbnail": "http://books.google.com/books/content?id=D3E_DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
        },
        "language": "ar"
      },
      "saleInfo": {
        "country": "EG",
        "price": "20"
      }
    },
    {
      "id": "PnfsDwAAQBAJ",
      "volumeInfo": {
        "title": "Story of the First Church: Book of Acts",
        "subtitle": "حكاية الكنيسة الأولى: سفر أعمال الرسل",
        "authors": ["Ihab Joseph, PhD."],
        "publisher": "Wael Adly",
        "publishedDate": "2019-08-05",
        "description": "Biblical Theology -- New Testament Theology -- Biblical Interpretation -- Commentary",
        "categories": "Juvenile Nonfiction",
        "averageRating": 3,
        "contentVersion": "0.0.1.0.preview.1",
        "imageLinks": {
          "smallThumbnail": "http://books.google.com/books/content?id=PnfsDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
          "thumbnail": "http://books.google.com/books/content?id=PnfsDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
        },
        "language": "ar"
      },
      "saleInfo": {
        "country": "EG",
        "price": "15"
      }
    },
    {
      "id": "8mSBDwAAQBAJ",
      "volumeInfo": {
        "title": "قصة النبي محمد صلى الله عليه وسلم The Story of Prophet Muhammad",
        "subtitle": "سلسلة قصص الأنبياء للأطفال Series of Prophets' Stories",
        "authors": [
          "Dar El Fikr Beirut",
          "دار الفكر",
          "dar el fikr",
          "dar al fikr"
        ],
        "publisher": "Dar El Fikr for Printing publishing and distribution (S.A.L.) دار الفكر للطباعة والنشر والتوزيع ش.م.ل. بيروت - لبنان",
        "publishedDate": "2018-04-17",
        "description": "قصة النبي محمد صلى الله عليه وسلم مشكولة للأطفال كما ذكرت في المراجع الأسلامية مع رسوم ملونة A story of Prophet Muhammad as mentioned in Islamic References with colored drawings",
        "categories": "Young Adult Fiction",
        "averageRating": 3,
        "ratingsCount": 1,
        "contentVersion": "preview-1.0.0",
        "imageLinks": {
          "smallThumbnail": "http://books.google.com/books/content?id=8mSBDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
          "thumbnail": "http://books.google.com/books/content?id=8mSBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
        },
        "language": "ar"
      }
    },
    {
      "id": "whV_DwAAQBAJ",
      "volumeInfo": {
        "title": "قصة النبي يوسف عليه السلام ,The Story of Prophet Yousuf Peace be upon him",
        "subtitle": "سلسلة قصص الأنبياء للأطفال Series of Prophets' Stories (piece be upon them)",
        "authors": [
          "Dar El Fikr Beirut",
          "دار الفكر",
          "dar el fikr",
          "dar al fikr"
        ],
        "publisher": "Dar El Fikr for Printing publishing and distribution (S.A.L.) دار الفكر للطباعة والنشر والتوزيع ش.م.ل. بيروت - لبنان",
        "publishedDate": "2018-04-17",
        "description": "قصة النبي يوسف عليه السلام مشكولة للأطفال كما ذكرت في المراجع الإسلامية مع رسوم ملونة A story of Prophet Yousuf (peace be upon him) as mentioned in Islamic References with colored drawings",
        "categories": "Young Adult Fiction",
        "averageRating": 2,
        "contentVersion": "preview-1.0.0",
        "imageLinks": {
          "smallThumbnail": "http://books.google.com/books/content?id=whV_DwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
          "thumbnail": "http://books.google.com/books/content?id=whV_DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
        },
        "language": "ar"
      }
    },
    {
      "id": "dzGBDwAAQBAJ",
      "volumeInfo": {
        "title": "قصة النبي ابراهيم عليه السلام ,The Story of Prophet Ibrahim Peace be upon him",
        "subtitle": "سلسلة قصص الأنبياء للأطفال Series of Prophets' Stories (piece be upon them)",
        "authors": [
          "dar al fikr",
          "dar el fikr Beirut",
          "دار الفكر",
          "islamicbooks"
        ],
        "publisher": "Dar El Fikr for Printing publishing and distribution (S.A.L.) دار الفكر للطباعة والنشر والتوزيع ش.م.ل. بيروت - لبنان",
        "publishedDate": "2018-04-17",
        "description": "قصة النبي ابراهيم عليه السلام مشكولة للأطفال كما ذكرت في المراجع الأسلامية مع رسوم ملونة A story of Prophet Yousuf (peace be upon him) as mentioned in Islamic References with colored drawings",
        "categories": "Young Adult Fiction",
        "averageRating": 2,
        "contentVersion": "preview-1.0.0",
        "imageLinks": {
          "smallThumbnail": "http://books.google.com/books/content?id=dzGBDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
          "thumbnail": "http://books.google.com/books/content?id=dzGBDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
        },
        "language": "ar"
      }
    },
    {
      "id": "LY6BDwAAQBAJ",
      "volumeInfo": {
        "title": "قصة النبيان صالح وشعيب عليهما السلام The Story of the two Prophets Saleh And shoeib Peace be upon them",
        "subtitle": "سلسلة قصص الأنبياء للأطفال Series of Prophets' Stories (piece be upon them)",
        "authors": [
          "Dar El Fikr Beirut",
          "دار الفكر",
          "dar el fikr",
          "dar al fikr"
        ],
        "publisher": "Dar El Fikr for Printing publishing and distribution (S.A.L.) دار الفكر للطباعة والنشر والتوزيع ش.م.ل. بيروت - لبنان",
        "description": "قصة النبيان صالح وشعيب عليهما السلام مشكولة للأطفال كما ذكرت في المراجع الإسلامية مع رسوم ملونة The stories of Prophet Saleh and Shoeib (peace be upon them) as mentioned in Islamic References with colored drawings",
        "categories": "Young Adult Fiction",
        "averageRating": 4,
        "contentVersion": "preview-1.0.0",
        "imageLinks": {
          "smallThumbnail": "http://books.google.com/books/content?id=LY6BDwAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
          "thumbnail": "http://books.google.com/books/content?id=LY6BDwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
        },
        "language": "ar"
      }
    }
  ],
  "Sience": [
    {
      "id": "HegDAAAAMBAJ",
      "volumeInfo": {
        "title": "Competition Science Vision",
        "publishedDate": "1999-06",
        "description": "Competition Science Vision (monthly magazine) is published by Pratiyogita Darpan Group in India and is one of the best Science monthly magazines available for medical entrance examination students in India. Well-qualified professionals of Physics, Chemistry, Zoology and Botany make contributions to this magazine and craft it with focus on providing complete and to-the-point study material for aspiring candidates. The magazine covers General Knowledge, Science and Technology news, Interviews of toppers of examinations, study material of Physics, Chemistry, Zoology and Botany with model papers, reasoning test questions, facts, quiz contest, general awareness and mental ability test in every monthly issue.",
        "averageRating": 5,
        "ratingsCount": 1,
        "contentVersion": "0.0.1.0.preview.1",
        "imageLinks": {
          "smallThumbnail": "http://books.google.com/books/content?id=HegDAAAAMBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
          "thumbnail": "http://books.google.com/books/content?id=HegDAAAAMBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
        },
        "language": "en"
      },
      "saleInfo": {
        "country": "EG",
        "price": "20"
      }
    },
    {
      "id": "qR8DAAAAMBAJ",
      "volumeInfo": {
        "title": "Popular Science",
        "publishedDate": "1872-05",
        "description": "Popular Science gives our readers the information and tools to improve their technology and their world. The core belief that Popular Science and our readers share: The future is going to be better, and science and technology are the driving forces that will help make it better.",
        "averageRating": 4,
        "contentVersion": "0.0.1.0.preview.1",
        "imageLinks": {
          "smallThumbnail": "http://books.google.com/books/content?id=qR8DAAAAMBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
          "thumbnail": "http://books.google.com/books/content?id=qR8DAAAAMBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
        },
        "language": "en"
      },
      "saleInfo": {
        "country": "EG",
        "price": "10"
      }
    },
    {
      "id": "kP6ESrt1xLUC",
      "volumeInfo": {
        "title": "Popular Science",
        "publishedDate": "2001-05",
        "description": "Popular Science gives our readers the information and tools to improve their technology and their world. The core belief that Popular Science and our readers share: The future is going to be better, and science and technology are the driving forces that will help make it better.",
        "averageRating": 4,
        "contentVersion": "0.0.1.0.preview.1",
        "imageLinks": {
          "smallThumbnail": "http://books.google.com/books/content?id=kP6ESrt1xLUC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
          "thumbnail": "http://books.google.com/books/content?id=kP6ESrt1xLUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
        },
        "language": "en"
      },
      "saleInfo": {
        "country": "EG",
        "price": "20"
      }
    },
    {
      "id": "pSADAAAAMBAJ",
      "volumeInfo": {
        "title": "Popular Science",
        "publishedDate": "1963-07",
        "description": "Popular Science gives our readers the information and tools to improve their technology and their world. The core belief that Popular Science and our readers share: The future is going to be better, and science and technology are the driving forces that will help make it better.",
        "averageRating": 3,
        "contentVersion": "0.0.1.0.preview.1",
        "imageLinks": {
          "smallThumbnail": "http://books.google.com/books/content?id=pSADAAAAMBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
          "thumbnail": "http://books.google.com/books/content?id=pSADAAAAMBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
        },
        "language": "en"
      },
      "saleInfo": {
        "country": "EG",
        "price": "12"
      }
    },
    {
      "id": "diYDAAAAMBAJ",
      "volumeInfo": {
        "title": "Popular Science",
        "publishedDate": "1938-02",
        "description": "Popular Science gives our readers the information and tools to improve their technology and their world. The core belief that Popular Science and our readers share: The future is going to be better, and science and technology are the driving forces that will help make it better.",
        "averageRating": 4,
        "contentVersion": "0.1.1.0.preview.1",
        "imageLinks": {
          "smallThumbnail": "http://books.google.com/books/content?id=diYDAAAAMBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
          "thumbnail": "http://books.google.com/books/content?id=diYDAAAAMBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
        },
        "language": "en"
      },
      "saleInfo": {
        "country": "EG",
        "price": "14"
      }
    },
    {
      "id": "D2zyNlMu7kkC",
      "volumeInfo": {
        "title": "Popular Science",
        "publishedDate": "2000-02",
        "description": "Popular Science gives our readers the information and tools to improve their technology and their world. The core belief that Popular Science and our readers share: The future is going to be better, and science and technology are the driving forces that will help make it better.",
        "averageRating": 5,
        "contentVersion": "0.0.1.0.preview.1",
        "imageLinks": {
          "smallThumbnail": "http://books.google.com/books/content?id=D2zyNlMu7kkC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
          "thumbnail": "http://books.google.com/books/content?id=D2zyNlMu7kkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
        },
        "language": "en"
      },
      "saleInfo": {
        "country": "EG",
        "price": "22"
      }
    }
  ],
  "Psychology": [
    {
      "id": "pX7p3AIs25kC",
      "volumeInfo": {
        "title": "Handbook of Psychology, Industrial and Organizational Psychology",
        "authors": ["Irving B. Weiner", "Neal W. Schmitt", "Scott Highhouse"],
        "publisher": "John Wiley & Sons",
        "publishedDate": "2012-10-16",
        "description": "Psychology is of interest to academics from many fields, as well as to the thousands of academic and clinical psychologists and general public who can't help but be interested in learning more about why humans think and behave as they do. This award-winning twelve-volume reference covers every aspect of the ever-fascinating discipline of psychology and represents the most current knowledge in the field. This ten-year revision now covers discoveries based in neuroscience, clinical psychology's new interest in evidence-based practice and mindfulness, and new findings in social, developmental, and forensic psychology.",
        "categories": "Psychology",
        "averageRating": 4,
        "contentVersion": "1.3.3.0.preview.1",
        "imageLinks": {
          "smallThumbnail": "http://books.google.com/books/content?id=pX7p3AIs25kC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
          "thumbnail": "http://books.google.com/books/content?id=pX7p3AIs25kC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
        },
        "language": "en"
      },
      "saleInfo": {
        "country": "EG",
        "price": "14"
      }
    },
    {
      "id": "l-8ZDAAAQBAJ",
      "volumeInfo": {
        "title": "Comparative Psychology for Clinical Psychologists and Therapists",
        "subtitle": "What Animal Behavior Can Tell Us about Human Psychology",
        "authors": ["Daniel C. Marston", "Terry L. Maple"],
        "publisher": "Jessica Kingsley Publishers",
        "publishedDate": "2016-05-19",
        "description": "Featuring animal research, from pigeons to primates, this book explains how comparative psychology can enrich our insights into human psychological processes. Each chapter covers a different clinical disorder or problem commonly encountered by clinical psychologists and therapists, including depression, autism and social communication disorders, substance abuse and obesity, and reviews related research into animal behaviors. Revealing how animal models can grant psychologists a better understanding of the motivations and causes for behaviors that are impossible or challenging to study in humans, the authors suggest interventions, drawn from research findings in comparative psychology, that can effectively address psychological disorders in humans.",
        "categories": "Psychology",
        "averageRating": 4,
        "contentVersion": "1.2.3.0.preview.3",
        "imageLinks": {
          "smallThumbnail": "http://books.google.com/books/content?id=l-8ZDAAAQBAJ&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
          "thumbnail": "http://books.google.com/books/content?id=l-8ZDAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
        },
        "language": "en"
      },
      "saleInfo": {
        "country": "EG",
        "price": "26"
      }
    },
    {
      "id": "UA5sI7qUzhMC",
      "volumeInfo": {
        "title": "A History of Modern Psychology in Context",
        "authors": ["Wade Pickren", "Alexandra Rutherford"],
        "publisher": "John Wiley & Sons",
        "publishedDate": "2010-02-19",
        "description": "A fresh look at the history of psychology placed in its social, political, and cultural contexts A History of Modern Psychology in Context presents the history of modern psychology in the richness of its many contexts. The authors resist the traditional storylines of great achievements by eminent people, or schools of thought that rise and fall in the wake of scientific progress. Instead, psychology is portrayed as a network of scientific and professional practices embedded in specific temporal, social, political, and cultural contexts. The narrative is informed by three key concepts—indigenization, reflexivity, and social constructionism—and by the fascinating interplay between disciplinary Psychology and everyday psychology. The authors complicate the notion of who is at the center and who is at the periphery of the history of psychology by bringing in actors and events that are often overlooked in traditional accounts. They also highlight how the reflexive nature of Psychology—a science produced both by and about humans—accords history a prominent place in understanding the discipline and the theories it generates. Throughout the text, the authors show how Psychology and psychologists are embedded in cultures that indelibly shape how the discipline is defined and practiced, the kind of knowledge it creates, and how this knowledge is received. The text also moves beyond an exclusive focus on the development of North American and European psychologies to explore the development of psychologies in other indigenous contexts, especially from the mid-20th-century onward.",
        "categories": "Psychology",
        "averageRating": 3,
        "contentVersion": "1.3.4.0.preview.3",
        "imageLinks": {
          "smallThumbnail": "http://books.google.com/books/content?id=UA5sI7qUzhMC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
          "thumbnail": "http://books.google.com/books/content?id=UA5sI7qUzhMC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
        },
        "language": "en"
      },
      "saleInfo": {
        "country": "EG",
        "peice": "21"
      }
    },
    {
      "id": "5zDMyTKliLcC",
      "volumeInfo": {
        "title": "Science as Psychology",
        "subtitle": "Sense-Making and Identity in Science Practice",
        "authors": [
          "Lisa M. Osbeck",
          "Nancy J. Nersessian",
          "Kareen R. Malone",
          "Wendy C. Newstetter"
        ],
        "publisher": "Cambridge University Press",
        "publishedDate": "2010-11-22",
        "description": "Science as Psychology reveals the complexity and richness of rationality by demonstrating how social relationships, emotion, culture, and identity are implicated in the problem-solving practices of laboratory scientists. In this study, the authors gather and analyze interview and observational data from innovation-focused laboratories in the engineering sciences to show how the complex practices of laboratory research scientists provide rich psychological insights, and how a better understanding of science practice facilitates understanding of human beings more generally. The study focuses not on dismantling the rational core of scientific practice, but on illustrating how social, personal, and cognitive processes are intricately woven together in scientific thinking. The book is thus a contribution to science studies, the psychology of science, and general psychology.",
        "categories": "Psychology",
        "averageRating": 4,
        "contentVersion": "0.1.3.0.preview.3",
        "imageLinks": {
          "smallThumbnail": "http://books.google.com/books/content?id=5zDMyTKliLcC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
          "thumbnail": "http://books.google.com/books/content?id=5zDMyTKliLcC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
        },
        "language": "en"
      },
      "saleInfo": {
        "country": "EG",
        "price": "30"
      }
    },
    {
      "id": "VuHFFpZCg-QC",
      "volumeInfo": {
        "title": "The Psychology of Stereotyping",
        "authors": ["David J. Schneider"],
        "publisher": "Guilford Press",
        "publishedDate": "2004-01-01",
        "description": "The first comprehensive treatment of stereotypes and stereotyping, this text synthesizes a vast body of social and cognitive research that has emerged over the past-quarter century. Provided is an unusually broad analysis of stereotypes as products both of individual cognitive activities and of social and cultural forces. While devoting careful attention to harmful aspects of stereotypes, their connections to prejudice and discrimination, and effective strategies for countering them, the volume also examines the positive functions of generalizations in helping people navigate a complex world. Unique features include four chapters addressing the content of stereotypes, which consider such topics as why certain traits are the focus of stereotyping and how they become attributed to particular groups. An outstanding text for advanced undergraduate- and graduate-level courses, the volume is highly readable and features many useful examples.",
        "categories": "Psychology",
        "averageRating": 5,
        "contentVersion": "0.9.9.0.preview.0",
        "imageLinks": {
          "smallThumbnail": "http://books.google.com/books/content?id=VuHFFpZCg-QC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
          "thumbnail": "http://books.google.com/books/content?id=VuHFFpZCg-QC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
        },
        "language": "en"
      },
      "saleInfo": {
        "country": "EG",
        "price": "11"
      }
    },
    {
      "id": "JJ818X3FjRUC",
      "volumeInfo": {
        "title": "Health Psychology",
        "subtitle": "A Discipline and a Profession",
        "authors": ["George C. Stone"],
        "publisher": "University of Chicago Press",
        "publishedDate": "1987-05-18",
        "description": "In 1976, a small group of psychologists urged that more research be done on aspects of health and health care outside the domain of mental health. Today, health psychology is one of the fastest growing divisions of the American Psychological Association; journals and textbooks in increasing numbers are another signal of rapid growth in this field.",
        "categories": "Medical",
        "averageRating": 4,
        "contentVersion": "0.13.17.0.preview.3",
        "imageLinks": {
          "smallThumbnail": "http://books.google.com/books/content?id=JJ818X3FjRUC&printsec=frontcover&img=1&zoom=5&edge=curl&source=gbs_api",
          "thumbnail": "http://books.google.com/books/content?id=JJ818X3FjRUC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api"
        },
        "language": "en"
      },
      "saleInfo": {
        "country": "EG",
        "price": "15"
      }
    }
  ],
  "products": [
    {
      "img": "1.jpg",
      "title": "Blue T-shirt",
      "description": "Comfortable cotton T-shirt in blue.",
      "price": 15.99
    },
    {
      "img": "2.jpg",
      "title": "Running Shoes",
      "description": "High-performance running shoes for all terrains.",
      "price": 79.99
    },
    {
      "img": "3.jpg",
      "title": "Coffee Mug",
      "description": "Stylish ceramic mug for your favorite beverages.",
      "price": 9.99
    },
    {
      "img": "4.jpg",
      "title": "Wireless Headphones",
      "description": "Noise-canceling wireless headphones with long battery life.",
      "price": 129.99
    },
    {
      "img": "5.jpg",
      "title": "Laptop Backpack",
      "description": "Durable backpack with multiple compartments for laptops and accessories.",
      "price": 49.99
    },
    {
      "img": "6.jpg",
      "title": "Desk Lamp",
      "description": "Adjustable LED desk lamp for optimal lighting.",
      "price": 29.99
    },
    {
      "img": "7.jpg",
      "title": "Cookbook",
      "description": "Delicious recipes for every occasion.",
      "price": 19.99
    },
    {
      "img": "8.jpg",
      "title": "Water Bottle",
      "description": "Reusable water bottle for staying hydrated on the go.",
      "price": 12.99
    }
  ],
  "authors": [
   {
     "id": 1,
     "name": "Eric-Emanual Schmitt",
     "birth_date": "March 28, 1960",
     "nationality": "Belgian",
     "biography": "Eric-Emanual Schmitt is a Belgian author and playwright. He is known for his philosophical and often existential themes in his works. Schmitt's diverse literary contributions include novels, short stories, and plays.",
     "best_book": {
       "title": "The Book of Hidden Things",
       "published_year": 2009,
       "genre": "Fiction",
       "description": "The Book of Hidden Things follows the journey of four childhood friends who reunite annually in their hometown in southern Italy. When one of them mysteriously goes missing, the remaining friends embark on a quest to discover the truth behind his disappearance, uncovering secrets and confronting their own buried truths."
     }
   },
   {
     "id": 2,
     "name": "Another Author",
     "birth_date": "January 1, 1980",
     "nationality": "Unknown",
     "biography": "A brief biography of another author.",
     "best_book": {
       "title": "Best Book Ever",
       "published_year": 2015,
       "genre": "Mystery",
       "description": "A description of the best book by Another Author."
     }
   },
   {
     "id": 3,
     "name": "Jane Doe",
     "birth_date": "December 15, 1975",
     "nationality": "American",
     "biography": "Jane Doe is an American author known for her captivating storytelling and imaginative narratives. She has received acclaim for her contributions to the science fiction and fantasy genres.",
     "best_book": {
       "title": "The Enchanted Realm",
       "published_year": 2012,
       "genre": "Fantasy",
       "description": "The Enchanted Realm transports readers to a magical world filled with mythical creatures and epic adventures. Jane Doe weaves a tale of courage, friendship, and the enduring power of imagination."
     }
   },
   {
     "id": 4,
     "name": "John Smith",
     "birth_date": "September 10, 1985",
     "nationality": "British",
     "biography": "John Smith is a British author and poet. His works explore themes of introspection, nature, and the human experience. Smith's poetry has resonated with readers around the world.",
     "best_book": {
       "title": "Echoes of Silence",
       "published_year": 2018,
       "genre": "Poetry",
       "description": "Echoes of Silence is a collection of poignant poems that delve into the depths of human emotions. John Smith's lyrical verses capture the beauty and complexity of life, inviting readers to reflect on their own journeys."
     }
   }
 ]
}
